<a href="https://colab.research.google.com/github/sahil301290/Python-for-Data-Science/blob/main/06_2_Pandas_ConditionalFiltering_MethodCalls_DescriptionSorting.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##Agenda:

Introduction to Conditional Filtering

Method Calls in Pandas

Description and Sorting

##Introduction to Conditional Filtering

In data analysis, our datasets are large enough that we don't filter out data based on locations, instead, we do it based on a condition.

Conditional Filtering allows us to select rows based on a condition on column.

Hence, we should focus on organizing our data.

In [1]:
import numpy as np
import pandas as pd

Columns are features

Rows are instances of data

In [2]:
myindex = ['India', 'USA', 'Canada']
mydata = [[1947,1390, 10], [1776, 33, 20], [1867, 20, 12]]
mycolumns = ['Independence', 'Population', 'GDP']
df = pd.DataFrame(data = mydata, index = myindex, columns = mycolumns)
df

        Independence  Population  GDP
India           1947        1390   10
USA             1776          33   20
Canada          1867          20   12

Which countries have Population more than X?

Which countries have GDP less than Y?

Which country got the independence first?

In [3]:
#Which countries have population greater than 30?
df['Population']>30
#df[df['Population']>30]

India      True
USA        True
Canada    False
Name: Population, dtype: bool

Key steps:
- Grab the column for comparison
- Perform a comparison to get series of boolean values
- Pass that series of boolean values into DataFrame

Conditional Filtering
- Filter by Single Condition
- Filter by Multiple Condition
- Check against multiple possible values

Reading dataset: https://www.kaggle.com/ranjeetjain3/seaborn-tips-dataset

In [4]:
df = pd.read_csv('tips.csv')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

Adding random numbers with Heading of "Aadhar Number" of every person in the dataframe

In [5]:
Aadhar_Number = np.random.randint(100000000000, 999999999999, len(df))
Aadhar_Number

array([649113305390, 845508000441, 389694302658, 641282435214,
       465590457218, 847823928090, 105805087304, 763009198632,
       710704639628, 573996366891, 214173075634, 236294906848,
       766853867227, 743318813010, 639071470350, 360095087717,
       361027962519, 132699453086, 734777501992, 151095224613,
       292135448480, 701570771147, 815929667507, 219719281208,
       773208444098, 598895984616, 950187540169, 615148583037,
       222993035554, 930907693277, 442339024998, 879154498175,
       595073190433, 977326519990, 777997406625, 622540812012,
       980288901904, 188935017532, 872195829317, 111585715698,
       382090663360, 995296010812, 933710029137, 716809042626,
       350317182439, 809922684343, 612936081172, 805773029377,
       479311947381, 954392030735, 474098775288, 840181044947,
       310880165350, 578312309908, 844355984232, 594402175724,
       979026831745, 452223725018, 478184853380, 891323614141,
       287140248581, 159871514371, 409305207643, 629660111880,
       897606801025, 901807907730, 716242368095, 133131792858,
       798042491909, 643686029069, 786861383647, 639965568863,
       235603790204, 765848897263, 576810195141, 105115120278,
       229821021460, 201924912685, 791534990493, 796169107140,
       723392830704, 486515322637, 182858301534, 527236993189,
       365474027646, 262875933444, 518267671148, 434052444774,
       157293925495, 779538575366, 834466056794, 988414329163,
       933426043179, 360703870902, 281852775043, 704677167986,
       216693154122, 889150859535, 305006264516, 861666741755,
       724531469616, 299886360648, 414979497312, 421370448256,
       670171140383, 911143455614, 505064026965, 306617398903,
       887332547307, 689723424026, 462219632261, 547537519684,
       635646645422, 549133547904, 661836235471, 588613385535,
       971742334688, 903949005545, 745902787539, 661318344996,
       296698375842, 666563185945, 211036058589, 667476600856,
       608656892398, 561145272429, 720332437650, 798258046724,
       367343647977, 680460064539, 845684395266, 159620217926,
       910301947747, 882063187427, 415605750794, 276248955072,
       812226309350, 759782287634, 830756187728, 961412028835,
       983927242626, 736397176148, 896324104023, 460610003999,
       457225578890, 739350596891, 775213099101, 138185945709,
       434169867015, 336061173858, 823265486002, 679409289110,
       240943320595, 848720096075, 921701069857, 174235464982,
       642094077163, 522583408114, 700025937096, 324566788529,
       333971175088, 925027720725, 923174789969, 868224788239,
       776467737981, 969976468385, 442926450944, 138809021783,
       777058609513, 154915026688, 564430181378, 145722874869,
       636606060364, 119256361130, 978048504613, 118854092656,
       257015814501, 748990786400, 582145505749, 965888382947,
       895884702964, 603967795174, 589896944892, 406729536025,
       536855841349, 596131405051, 556703063311, 214287992072,
       542190109087, 489323913721, 965163336752, 940821370957,
       579948838985, 276491370323, 880428849362, 702425005839,
       794422542485, 700182133741, 939515939978, 748046663116,
       992209864689, 181229499283, 126710562518, 791786835494,
       207651940460, 272738883213, 377793208061, 157009894226,
       665177204326, 878630953258, 993379676037, 816442395748,
       640806083658, 384388460659, 859583095982, 492155083921,
       335720398551, 360712454246, 449926113537, 956300413308,
       220529911112, 985765161344, 570056732077, 592402892998,
       405905560878, 121464738560, 233324224451, 700827756715,
       158992957442, 611563870295, 601128861511, 637924228615,
       213808815196, 796855142948, 102598334546, 212414890490,
       473643993621, 743543553048, 861410214117, 490871857146,
       349358289382, 321917447108, 105824138366, 527053368358])

In [6]:
df['Aadhar_Number'] = pd.DataFrame(Aadhar_Number)
df.head()

   total_bill   tip     sex smoker  day    time  size  Aadhar_Number
0       16.99  1.01  Female     No  Sun  Dinner     2   649113305390
1       10.34  1.66    Male     No  Sun  Dinner     3   845508000441
2       21.01  3.50    Male     No  Sun  Dinner     3   389694302658
3       23.68  3.31    Male     No  Sun  Dinner     2   641282435214
4       24.59  3.61  Female     No  Sun  Dinner     4   465590457218

###Filter by Single Condition

In [7]:
df['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [8]:
#Give all rows where total bill is greater than 45
bool_series = df['total_bill'] > 45

In [9]:
df[bool_series]

     total_bill    tip   sex smoker  day    time  size  Aadhar_Number
59        48.27   6.73  Male     No  Sat  Dinner     4   891323614141
156       48.17   5.00  Male     No  Sun  Dinner     6   642094077163
170       50.81  10.00  Male    Yes  Sat  Dinner     3   564430181378
182       45.35   3.50  Male    Yes  Sun  Dinner     3   589896944892
212       48.33   9.00  Male     No  Sat  Dinner     4   640806083658

In [10]:
df[df['total_bill'] > 45]

     total_bill    tip   sex smoker  day    time  size  Aadhar_Number
59        48.27   6.73  Male     No  Sat  Dinner     4   891323614141
156       48.17   5.00  Male     No  Sun  Dinner     6   642094077163
170       50.81  10.00  Male    Yes  Sat  Dinner     3   564430181378
182       45.35   3.50  Male    Yes  Sun  Dinner     3   589896944892
212       48.33   9.00  Male     No  Sat  Dinner     4   640806083658

In [11]:
#Give all rows where sex is Male
df[df['sex'] == 'Male']

     total_bill   tip   sex smoker  day    time  size  Aadhar_Number
1         10.34  1.66  Male     No  Sun  Dinner     3   845508000441
2         21.01  3.50  Male     No  Sun  Dinner     3   389694302658
3         23.68  3.31  Male     No  Sun  Dinner     2   641282435214
5         25.29  4.71  Male     No  Sun  Dinner     4   847823928090
6          8.77  2.00  Male     No  Sun  Dinner     2   105805087304
..          ...   ...   ...    ...  ...     ...   ...            ...
236       12.60  1.00  Male    Yes  Sat  Dinner     2   473643993621
237       32.83  1.17  Male    Yes  Sat  Dinner     2   743543553048
239       29.03  5.92  Male     No  Sat  Dinner     3   490871857146
241       22.67  2.00  Male    Yes  Sat  Dinner     2   321917447108
242       17.82  1.75  Male     No  Sat  Dinner     2   105824138366

[157 rows x 8 columns]

In [12]:
#Give all rows where size of party is >4
df[df['size'] > 4]

     total_bill   tip     sex smoker   day    time  size  Aadhar_Number
125       29.80  4.20  Female     No  Thur   Lunch     6   561145272429
141       34.30  6.70    Male     No  Thur   Lunch     6   736397176148
142       41.19  5.00    Male     No  Thur   Lunch     5   896324104023
143       27.05  5.00  Female     No  Thur   Lunch     6   460610003999
155       29.85  5.14  Female     No   Sun  Dinner     5   174235464982
156       48.17  5.00    Male     No   Sun  Dinner     6   642094077163
185       20.69  5.00    Male     No   Sun  Dinner     5   596131405051
187       30.46  2.00    Male    Yes   Sun  Dinner     5   214287992072
216       28.15  3.00    Male    Yes   Sat  Dinner     5   335720398551

###Filter by Multiple Condition

AND (&) operator when BOTH conditions need to be true

OR (|) operator when EITHER condition is true

In [13]:
#1 == 1 and 5 == 5

In [14]:
#df[(df['total_bill'] > 40) AND (df['sex'] == 'Male')]
df[(df['total_bill'] > 40) & (df['sex'] == 'Male')]

     total_bill    tip   sex smoker   day    time  size  Aadhar_Number
59        48.27   6.73  Male     No   Sat  Dinner     4   891323614141
95        40.17   4.73  Male    Yes   Fri  Dinner     4   704677167986
142       41.19   5.00  Male     No  Thur   Lunch     5   896324104023
156       48.17   5.00  Male     No   Sun  Dinner     6   642094077163
170       50.81  10.00  Male    Yes   Sat  Dinner     3   564430181378
182       45.35   3.50  Male    Yes   Sun  Dinner     3   589896944892
184       40.55   3.00  Male    Yes   Sun  Dinner     2   536855841349
212       48.33   9.00  Male     No   Sat  Dinner     4   640806083658

###Check against multiple possible values

In [15]:
df.head()

   total_bill   tip     sex smoker  day    time  size  Aadhar_Number
0       16.99  1.01  Female     No  Sun  Dinner     2   649113305390
1       10.34  1.66    Male     No  Sun  Dinner     3   845508000441
2       21.01  3.50    Male     No  Sun  Dinner     3   389694302658
3       23.68  3.31    Male     No  Sun  Dinner     2   641282435214
4       24.59  3.61  Female     No  Sun  Dinner     4   465590457218

In [16]:
#Return rows where day is Sat or Sun or Fri
df[(df['day'] == 'Sat') | (df['day'] == 'Sun') | (df['day'] == 'Fri')]

     total_bill   tip     sex smoker  day    time  size  Aadhar_Number
0         16.99  1.01  Female     No  Sun  Dinner     2   649113305390
1         10.34  1.66    Male     No  Sun  Dinner     3   845508000441
2         21.01  3.50    Male     No  Sun  Dinner     3   389694302658
3         23.68  3.31    Male     No  Sun  Dinner     2   641282435214
4         24.59  3.61  Female     No  Sun  Dinner     4   465590457218
..          ...   ...     ...    ...  ...     ...   ...            ...
238       35.83  4.67  Female     No  Sat  Dinner     3   861410214117
239       29.03  5.92    Male     No  Sat  Dinner     3   490871857146
240       27.18  2.00  Female    Yes  Sat  Dinner     2   349358289382
241       22.67  2.00    Male    Yes  Sat  Dinner     2   321917447108
242       17.82  1.75    Male     No  Sat  Dinner     2   105824138366

[182 rows x 8 columns]

In [17]:
#When column is same, isin technique can be useful
options = ['Fri', 'Sat', 'Sun']
df['day'].isin(options)
#df[df['day'].isin(options)]

0       True
1       True
2       True
3       True
4       True
       ...
239     True
240     True
241     True
242     True
243    False
Name: day, Length: 244, dtype: bool

##Method Calls in Pandas

Documentation Link: https://pandas.pydata.org/pandas-docs/stable/reference/index.html

###Apply Function .apply()
Apply any custom python function of our own to every row in a Series

####Apply on single column

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   total_bill     244 non-null    float64
 1   tip            244 non-null    float64
 2   sex            244 non-null    object
 3   smoker         244 non-null    object
 4   day            244 non-null    object
 5   time           244 non-null    object
 6   size           244 non-null    int64
 7   Aadhar_Number  244 non-null    int64
dtypes: float64(2), int64(2), object(4)
memory usage: 15.4+ KB

In [19]:
#Aadhar_Number[0][0]
str(Aadhar_Number[0])[0]

'6'

In [20]:
str(Aadhar_Number[0])[:4]

'6491'

In [21]:
def Aadhar_series(num):
  return str(num)[0]

In [22]:
Aadhar_series(213421352643)

'2'

In [23]:
df['Aadhar_Number'].apply(Aadhar_series)

0      6
1      8
2      3
3      6
4      4
      ..
239    4
240    3
241    3
242    1
243    5
Name: Aadhar_Number, Length: 244, dtype: object

In [24]:
df['Aadhar_Series'] = df['Aadhar_Number'].apply(Aadhar_series)
df.head()

   total_bill   tip     sex smoker  ...    time size  Aadhar_Number  Aadhar_Series
0       16.99  1.01  Female     No  ...  Dinner    2   649113305390              6
1       10.34  1.66    Male     No  ...  Dinner    3   845508000441              8
2       21.01  3.50    Male     No  ...  Dinner    3   389694302658              3
3       23.68  3.31    Male     No  ...  Dinner    2   641282435214              6
4       24.59  3.61  Female     No  ...  Dinner    4   465590457218              4

[5 rows x 9 columns]

In [25]:
#df['total_bill']
df['total_bill'].mean()

19.785942622950824

Defining function to know how costly the restaurant is.

In [26]:
def Pricy(price):
  if price < 10:
    return '$'
  elif price >= 10 and price < 30:
    return '$$'
  else:
    return '$$$'

In [27]:
df['Costly'] = df['total_bill'].apply(Pricy)
df.head()

   total_bill   tip     sex smoker  ... size Aadhar_Number  Aadhar_Series  Costly
0       16.99  1.01  Female     No  ...    2  649113305390              6      $$
1       10.34  1.66    Male     No  ...    3  845508000441              8      $$
2       21.01  3.50    Male     No  ...    3  389694302658              3      $$
3       23.68  3.31    Male     No  ...    2  641282435214              6      $$
4       24.59  3.61  Female     No  ...    4  465590457218              4      $$

[5 rows x 10 columns]

####Apply on multiple columns

- using Lambda Function
- using NumPy Vectorize

Reviewing Lambda Function

In [28]:
def simple(num):
  return num*2

In [29]:
simple(3)

6

Lambda is an anonymous function. Hence no name.

In [30]:
lambda num: num * 2

In [31]:
df['total_bill'].apply(lambda bill: bill * 2)

0      33.98
1      20.68
2      42.02
3      47.36
4      49.18
       ...
239    58.06
240    54.36
241    45.34
242    35.64
243    37.56
Name: total_bill, Length: 244, dtype: float64

https://stackoverflow.com/questions/19914937/applying-function-with-multiple-arguments-to-create-a-new-pandas-column

In [32]:
df.head()

   total_bill   tip     sex smoker  ... size Aadhar_Number  Aadhar_Series  Costly
0       16.99  1.01  Female     No  ...    2  649113305390              6      $$
1       10.34  1.66    Male     No  ...    3  845508000441              8      $$
2       21.01  3.50    Male     No  ...    3  389694302658              3      $$
3       23.68  3.31    Male     No  ...    2  641282435214              6      $$
4       24.59  3.61  Female     No  ...    4  465590457218              4      $$

[5 rows x 10 columns]

Is tip generous or not?

In [33]:
def quality(total_bill, tip):
  if tip/total_bill > 0.2:
    return 'Generous'
  else:
    return 'Other'

In [34]:
quality(20,6)

'Generous'

Apply function on df using Lambda Function

In [35]:
df[['total_bill', 'tip']].apply(lambda df: quality(df['total_bill'], df['tip']), axis = 1)

0         Other
1         Other
2         Other
3         Other
4         Other
         ...
239    Generous
240       Other
241       Other
242       Other
243       Other
Length: 244, dtype: object

In [36]:
df['Quality_of_tip'] = df[['total_bill', 'tip']].apply(lambda df: quality(df['total_bill'], df['tip']), axis = 1)
df.head()

   total_bill   tip     sex  ... Aadhar_Series Costly Quality_of_tip
0       16.99  1.01  Female  ...             6     $$          Other
1       10.34  1.66    Male  ...             8     $$          Other
2       21.01  3.50    Male  ...             3     $$          Other
3       23.68  3.31    Male  ...             6     $$          Other
4       24.59  3.61  Female  ...             4     $$          Other

[5 rows x 11 columns]

Apply function on df using NumPy Vectorize

In [37]:
df['Quality_of_tip'] = np.vectorize(quality)(df['total_bill'], df['tip'])
df.head()

   total_bill   tip     sex  ... Aadhar_Series Costly Quality_of_tip
0       16.99  1.01  Female  ...             6     $$          Other
1       10.34  1.66    Male  ...             8     $$          Other
2       21.01  3.50    Male  ...             3     $$          Other
3       23.68  3.31    Male  ...             6     $$          Other
4       24.59  3.61  Female  ...             4     $$          Other

[5 rows x 11 columns]

What is NumPy Vectorize and how fast is it?

https://stackoverflow.com/questions/3379301/using-numpy-vectorize-on-functions-that-return-vectors

np.vectorize is just a convenience function. It doesn't actually make code run any faster. If it isn't convenient to use np.vectorize, simply write your own function that works as you wish.

The purpose of np.vectorize is to transform functions which are not numpy-aware (e.g. take floats as input and return floats as output) into functions that can operate on (and return) numpy arrays.

Checking time difference between lambda and vectorize method

In [38]:
import time

In [39]:
tic = time.time()
df['Quality_of_tip'] = df[['total_bill', 'tip']].apply(lambda df: quality(df['total_bill'], df['tip']), axis = 1)
toc = time.time()
df.head()
print("Lambda Version:"+str(1000*(toc-tic))+"ms")
tic = time.time()
df['Quality_of_tip'] = np.vectorize(quality)(df['total_bill'], df['tip'])
toc = time.time()
df.head()
print("Vectorize Version:"+str(1000*(toc-tic))+"ms")

Lambda Version:8.785247802734375ms
Vectorize Version:1.0442733764648438ms

##Description and Sorting

###Description

In [40]:
df = pd.read_csv('tips.csv')

In [41]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

###Sorting the DataFrame

In [42]:
df.sort_values('tip', ascending=False)

     total_bill    tip     sex smoker   day    time  size
170       50.81  10.00    Male    Yes   Sat  Dinner     3
212       48.33   9.00    Male     No   Sat  Dinner     4
23        39.42   7.58    Male     No   Sat  Dinner     4
59        48.27   6.73    Male     No   Sat  Dinner     4
141       34.30   6.70    Male     No  Thur   Lunch     6
..          ...    ...     ...    ...   ...     ...   ...
0         16.99   1.01  Female     No   Sun  Dinner     2
236       12.60   1.00    Male    Yes   Sat  Dinner     2
111        7.25   1.00  Female     No   Sat  Dinner     1
67         3.07   1.00  Female    Yes   Sat  Dinner     1
92         5.75   1.00  Female    Yes   Fri  Dinner     2

[244 rows x 7 columns]

In [43]:
df.sort_values(['tip','size'])

     total_bill    tip     sex smoker   day    time  size
67         3.07   1.00  Female    Yes   Sat  Dinner     1
111        7.25   1.00  Female     No   Sat  Dinner     1
92         5.75   1.00  Female    Yes   Fri  Dinner     2
236       12.60   1.00    Male    Yes   Sat  Dinner     2
0         16.99   1.01  Female     No   Sun  Dinner     2
..          ...    ...     ...    ...   ...     ...   ...
141       34.30   6.70    Male     No  Thur   Lunch     6
59        48.27   6.73    Male     No   Sat  Dinner     4
23        39.42   7.58    Male     No   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
170       50.81  10.00    Male    Yes   Sat  Dinner     3

[244 rows x 7 columns]

###Switching and Mapping Method

In [44]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [45]:
#Replace Female with F and Male with M
df['sex'].replace('Female', 'F')

0         F
1      Male
2      Male
3      Male
4         F
       ...
239    Male
240       F
241    Male
242    Male
243       F
Name: sex, Length: 244, dtype: object

In [46]:
df['sex'].replace(['Female', 'Male'],['F', 'M'])

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

Map Functionality

In [47]:
mymap = {'Female':'F', 'Male':'M'}

In [48]:
df['sex'].map(mymap)

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

Check for Duplicated Row

In [49]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Length: 244, dtype: bool

In [50]:
sample_df = pd.DataFrame([1,2,3,3],['a','b','c','d'])
sample_df

   0
a  1
b  2
c  3
d  3

In [51]:
sample_df.duplicated()

a    False
b    False
c    False
d     True
dtype: bool

In [52]:
sample_df.drop_duplicates()

   0
a  1
b  2
c  3

In [53]:
#Values between two values
df['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [54]:
df['total_bill'].between(15,20,inclusive = True)

0       True
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242     True
243     True
Name: total_bill, Length: 244, dtype: bool

In [55]:
df[df['total_bill'].between(15,20,inclusive = True)]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
8         15.04  1.96    Male     No   Sun  Dinner     2
12        15.42  1.57    Male     No   Sun  Dinner     2
13        18.43  3.00    Male     No   Sun  Dinner     4
17        16.29  3.71    Male     No   Sun  Dinner     3
..          ...   ...     ...    ...   ...     ...   ...
225       16.27  2.50  Female    Yes   Fri   Lunch     2
231       15.69  3.00    Male    Yes   Sat  Dinner     3
234       15.53  3.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[67 rows x 7 columns]

In [56]:
#n-smallest and n-largest
df.nsmallest(2, 'tip')

    total_bill  tip     sex smoker  day    time  size
67        3.07  1.0  Female    Yes  Sat  Dinner     1
92        5.75  1.0  Female    Yes  Fri  Dinner     2

In [57]:
df.nlargest(2, 'tip')

     total_bill   tip   sex smoker  day    time  size
170       50.81  10.0  Male    Yes  Sat  Dinner     3
212       48.33   9.0  Male     No  Sat  Dinner     4

In [58]:
df.sort_values('tip',ascending=False).iloc[0:2]

     total_bill   tip   sex smoker  day    time  size
170       50.81  10.0  Male    Yes  Sat  Dinner     3
212       48.33   9.0  Male     No  Sat  Dinner     4

In [59]:
#Sampling
df.sample(5)

     total_bill   tip     sex smoker   day    time  size
129       22.82  2.18    Male     No  Thur   Lunch     3
37        16.93  3.07  Female     No   Sat  Dinner     3
53         9.94  1.56    Male     No   Sun  Dinner     2
29        19.65  3.00  Female     No   Sat  Dinner     2
90        28.97  3.00    Male    Yes   Fri  Dinner     2

In [60]:
df.sample(frac=0.1)

     total_bill   tip     sex smoker   day    time  size
67         3.07  1.00  Female    Yes   Sat  Dinner     1
153       24.55  2.00    Male     No   Sun  Dinner     4
156       48.17  5.00    Male     No   Sun  Dinner     6
7         26.88  3.12    Male     No   Sun  Dinner     4
66        16.45  2.47  Female     No   Sat  Dinner     2
94        22.75  3.25  Female     No   Fri  Dinner     2
159       16.49  2.00    Male     No   Sun  Dinner     4
190       15.69  1.50    Male    Yes   Sun  Dinner     2
224       13.42  1.58    Male    Yes   Fri   Lunch     2
42        13.94  3.06    Male     No   Sun  Dinner     2
210       30.06  2.00    Male    Yes   Sat  Dinner     3
36        16.31  2.00    Male     No   Sat  Dinner     3
113       23.95  2.55    Male     No   Sun  Dinner     2
151       13.13  2.00    Male     No   Sun  Dinner     2
237       32.83  1.17    Male    Yes   Sat  Dinner     2
77        27.20  4.00    Male     No  Thur   Lunch     4
108       18.24  3.76    Male     No   Sat  Dinner     2
63        18.29  3.76    Male    Yes   Sat  Dinner     4
242       17.82  1.75    Male     No   Sat  Dinner     2
46        22.23  5.00    Male     No   Sun  Dinner     2
193       15.48  2.02    Male    Yes  Thur   Lunch     2
174       16.82  4.00    Male    Yes   Sun  Dinner     2
43         9.68  1.32    Male     No   Sun  Dinner     2
13        18.43  3.00    Male     No   Sun  Dinner     4

###Other Functions

In [61]:
df['total_bill'].max()    #Max Value

50.81

In [62]:
df['total_bill'].idxmax()   #Index of Max Value

170

In [63]:
df.iloc[170]

total_bill     50.81
tip               10
sex             Male
smoker           Yes
day              Sat
time          Dinner
size               3
Name: 170, dtype: object

In [64]:
df.iloc[df['total_bill'].idxmin()]

total_bill      3.07
tip                1
sex           Female
smoker           Yes
day              Sat
time          Dinner
size               1
Name: 67, dtype: object

In [65]:
df.corr()   #Correlation of numeric columns

            total_bill       tip      size
total_bill    1.000000  0.675734  0.598315
tip           0.675734  1.000000  0.489299
size          0.598315  0.489299  1.000000

In [66]:
print(df.head())
print(df['sex'].value_counts())   #count of each category in DataFrame

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
Male      157
Female     87
Name: sex, dtype: int64

In [67]:
df['day']

0       Sun
1       Sun
2       Sun
3       Sun
4       Sun
       ...
239     Sat
240     Sat
241     Sat
242     Sat
243    Thur
Name: day, Length: 244, dtype: object

In [68]:
df['day'].unique()    #Unique values in a particular column

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [69]:
df['day'].nunique()   #Number of unique values

4

In [70]:
len(df['day'].unique())

4

In [71]:
df['day'].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64